<template>
  <div class="mod-home">
    <h3>项目背景</h3>
    <ul>
      <li>当今社会，随着科学技术的发展，以及市场经济的多元化，使人才的流动速度大大增加，因此也对党建工作的管理层面工作带来了空前且复杂的挑战，
        从而使得如何高效的开展管理党建工作成为了亟待解决的问题。为此将高速发展的信息科学技术引入到党建工作管理的应用中，力求合理有效的提升全面各项工作的进展，实现以人为本的科学发展思想和意识，是一种高效可实现的方法。
        Java作为一种面向对象的、可以撰写跨平台应用软件的程序设计语言，其技术具有卓越的通用性、高效性、平台移植性以及安全性，如今已广泛应用于 PC、数据中心、游戏控制台、科学超级计算机、移动电话和互联网等方面，大大方便了人们的生活、工作和娱乐。
        而基于Java技术的党建工作管理平台，结合了Java技术，从而可起到规范党群业务流程，提高党群工作管理效率，对于党群工作定期提醒，以及完
        成情况后的及时反馈，有效地提升党群工作管理的标准化程度的作用;进而实现党群工作的网上信息交流和交互办公，图片资料保存与共享等功能。当今社会，随着科学技术的发展，以及市场经济的多元化，使人才的流动速度大大增加，因此也对党建工作的管理层面工作带来了空前且复杂的挑战，
        从而使得如何高效的开展管理党建工作成为了亟待解决的问题。为此将高速发展的信息科学技术引入到党建工作管理的应用中，力求合理有效的提升全面各项工作的进展，实现以人为本的科学发展思想和意识，是一种高效可实现的方法。
        Java作为一种面向对象的、可以撰写跨平台应用软件的程序设计语言，其技术具有卓越的通用性、高效性、平台移植性以及安全性，如今已广泛应用于 PC、数据中心、游戏控制台、科学超级计算机、移动电话和互联网等方面，大大方便了人们的生活、工作和娱乐。
        而基于Java技术的党建工作管理平台，结合了Java技术，从而可起到规范党群业务流程，提高党群工作管理效率，对于党群工作定期提醒，以及完
        成情况后的及时反馈，有效地提升党群工作管理的标准化程度的作用;进而实现党群工作的网上信息交流和交互办公，图片资料保存与共享等功能。</li>
    </ul>
    <h3>主要技术介绍</h3>
    <ul>
      <li>vue</li>
      <li>elememnt ui</li>
      <li>spring Boot</li>
      <li>Spring Mvc</li>
      <li>mybatis</li>
      <li>shiro权限框架</li>
    </ul>
    <h3>系统模式架构</h3>
    <ul>
      <li>本系统经典的采用B/S架构(浏览器、服务器)，是采用浏览器和服务器架构模式设计的架构，随着Internet技术的兴起，对C/S架构模式的一种改变升级或改进。目前，在该架构的应用下，用户通过WWW.xxx.com浏览器实现数据访问和操作。一小部分事务逻辑在前端页面实现，主要业务事务逻辑在服务器端实现，形成三层结构MVC。B/S架构是Web兴起后主流的网络架构设计模式。Web浏览器是目前最重要的客户端应用软件之一。该模式形成了一个统一的客户端，将系统功能的所有核心部分集中在服务器上实现。简化系统开发和维护。只要客户端安装了浏览器就可以操作，服务器端安装了Oracle、MySQL、Sybase等数据库。浏览器通过Web Server和数据库获取数据。简化客户端计算机的负载，降低系统维护和升级的成本和工作量，降低用户的成本。</li>
    </ul>
  </div>
</template>

<script>
  export default {
  }
</script>

<style>
  .mod-home {
    line-height: 1.5;
  }
</style>

